Repository: eduardoviscencio/compaqi_test_app
Catalog: lib/presentation/l10n/app_*.arb
Languages: es

# authHeading
source: Welcome to the Locations App
es: Bienvenido a Locations App

# authSubHeading
source: Share your favorite locations with the world
es: Comparte tus lugares favoritos con el mundo

# loginGoogleLabel
source: Login with Google
es: Entrar con Google

# favoriteLocations
source: All favorite locations
es: Todos los lugares favoritos

# searchLocationInputLabel
source: Search for your favorite location
es: Busca tu lugar favorito

# searchLocationInputHint
source: Enter a location
es: Escribe un lugar

# saveFavoriteLabel
source: Save as favorite
es: Guardar como favorito

source: Guest
es: Invitado

# email
source: Not logged in
es: No autenticado

source: Logout
es: Salir

# saveLocationHeading
source: Save location as favorite
es: Guardar lugar como favorito

# saveLocationInputHint
source: Enter a location tag
es: Escribe una etiqueta para el lugar

# saveLocationInputLabel
source: Location tag
es: Etiqueta del lugar

# saveLocationLabel
source: Save
es: Guardar

# invalidInputValue
source: Please enter a valid value
es: Por favor, ingresa un valor válido

# fetchError
source: Failed to load data
es: Ocurrió un error al obtener los datos

source: You
es: Tú

# noLocations
source: No saved locations
es: No hay lugares guardados

source: Selected location
es: Lugar seleccionado

# locationSaved
source: Location saved successfully
es: Lugar guardado correctamente

# locationSaveError
source: Failed to save the location
es: No se pudo guardar el lugar

# locationDeleted
source: Location deleted successfully
es: Lugar eliminado correctamente

# deleteLocationError
source: Failed to delete the location
es: No se pudo eliminar el lugar

# loginFailed
source: Login failed. Please try again
es: No se pudo iniciar sesión. Intenta nuevamente.

# loginError
source: You cannot login with Google at this time
es: No es posible iniciar sesión con Google por ahora

# fetchLocationsError
source: Failed to fetch locations
es: No se pudieron obtener los lugares

# logoutSuccess
source: You have been logout out successfully
es: Has cerrado sesión correctamente

# invalidLocation
source: Invalid location selected
es: Lugar no válido seleccionado
